{
  "backend/main.mo": "Defines backend actor with access control, user/product/order/cart profile stores, sustainable living categories, and related data types and modules.",
  "feature_evidence.json": "Feature evidence report mapping two admin-focused User Guide features to affected files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each frontend file across routing, hooks, components, and pages.",
  "frontend/index.css": "Tailwind base and theme variables defining saffron/orange OKLCH color system for light and dark modes.",
  "frontend/index.html": "HTML entry point setting favicon, viewport, title, and loading the React main module.",
  "frontend/src/App.tsx": "Main React app component handling hash routing, identity loading, onboarding modal, page rendering, and global layout.",
  "frontend/src/components/AccessDeniedScreen.tsx": "Renders an admin-only access denied message with a shield icon and button to return home.",
  "frontend/src/components/AuthButton.tsx": "Login/logout button wired to Internet Identity with loading states and query cache clearing.",
  "frontend/src/components/MarketplaceHeader.tsx": "Marketplace header with logo, search, categories, user guide link, account access, cart indicator, and mobile menu.",
  "frontend/src/components/OnboardingModal.tsx": "Modal guiding users to select account type and submit profile details, handling buyer and seller registration flows.",
  "frontend/src/components/ProductCard.tsx": "Displays product info and image placeholder with add‑to‑cart handling, navigation, and stock status.",
  "frontend/src/components/ProductGrid.tsx": "Renders a grid of ProductCard components with loading skeletons and empty‑state handling.",
  "frontend/src/components/ProfileSetupModal.tsx": "Empty file placeholder for a profile setup modal component.",
  "frontend/src/components/QuantityControl.tsx": "Provides increment/decrement UI for numeric quantities with min/max and disabled handling.",
  "frontend/src/constants/sustainableLivingCategories.ts": "Defines sustainable living category list with helpers to fetch category data by ID.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, invalidating dependent queries on change.",
  "frontend/src/hooks/useAdminStatus.ts": "Checks whether the current authenticated user is an admin via the backend actor.",
  "frontend/src/hooks/useCart.ts": "Provides cart query and mutation hooks with unimplemented backend methods and subtotal calculation.",
  "frontend/src/hooks/useCompanyBankDetails.ts": "Hooks for fetching and updating company bank details, currently stubbed with unimplemented backend calls.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity auth context, loading, login, logout, and identity persistence logic.",
  "frontend/src/hooks/useOrders.ts": "Provides React Query hooks for listing, fetching, checking out, and canceling orders, all currently returning placeholders due to missing backend methods.",
  "frontend/src/hooks/useProducts.ts": "Implements product listing and fetching via actor calls, with addProduct mutation stubbed out pending backend support.",
  "frontend/src/hooks/useUserProfile.ts": "Defines hooks for fetching and saving user profiles and registering role-specific profiles, all currently stubbed due to unimplemented backend endpoints.",
  "frontend/src/index.css": "Configures Tailwind CSS and defines color variables for light and dark themes with a saffron/orange palette.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/pages/AccountPage.tsx": "Renders the user account page with profile display and editing, gated by identity and admin checks.",
  "frontend/src/pages/BrowsePage.tsx": "Shows a browsable product grid with search, category, price filtering, and sorting options.",
  "frontend/src/pages/CartPage.tsx": "Displays the shopping cart, allowing quantity changes and item removal, with identity checks and subtotal calculation.",
  "frontend/src/pages/CheckoutPage.tsx": "Implements the checkout UI, validates delivery details, computes subtotal, and submits an order via useCheckout.",
  "frontend/src/pages/CompanyAccountPage.tsx": "Provides an admin-only form to view and update company bank details, with authentication and editing controls.",
  "frontend/src/pages/DeliveryPartnerOnboardingPage.tsx": "Handles delivery partner registration with form validation, identity checks, and submission to create a partner profile.",
  "frontend/src/pages/HomePage.tsx": "Displays the landing page with hero content, category shortcuts, and featured products fetched from useListProducts.",
  "frontend/src/pages/OrderDetailsPage.tsx": "Shows detailed information for a specific order, including items, status, and an option to cancel pending orders.",
  "frontend/src/pages/OrdersPage.tsx": "Lists all user orders with status badges and navigation to detailed views, handling empty and loading states.",
  "frontend/src/pages/ProductDetailsPage.tsx": "Displays detailed product info, handles quantity selection, and adds items to the cart with identity checks and loading states.",
  "frontend/src/pages/SellerPortalPage.tsx": "Provides a seller-only form to add new products, with identity and permission checks and form validation.",
  "frontend/src/pages/UserGuidePage.tsx": "Renders a multi-tab user guide for buyers, sellers, and optionally admins with step-by-step instructions and illustrations.",
  "frontend/src/router/useHashRoute.ts": "Implements hash-based routing, parsing route, params, and query values, and provides a navigate helper.",
  "frontend/src/types/stubs.ts": "Defines placeholder types for users, profiles, cart items, orders, and enums used before backend implementation.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL and session parameters, including hash-based query parsing.",
  "frontend/tailwind.config.js": "Configures TailwindCSS theme extensions, colors, fonts, animations, and enabled plugins for the frontend.",
  "project_state.json": "Describes the project’s current state and requirements for building an ONDC‑compliant e‑commerce marketplace named Bozarhaat. Includes architectural notes, required images, and a list of existing implemented features."
}